tslight.cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-18 Wed 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Toby Slight" />
</head>
<body>
<div id="content">
<p>
\resheader{ Toby Slight }{ https://tslight.github.io }{ tslight@pm.me }{ +44 07412982139 }{ https://gitlab.com/tspub }{ https://github.com/tslight }
</p>

<div id="outline-container-org2b62671" class="outline-2">
<h2 id="org2b62671"><span class="section-number-2">1</span> Profile</h2>
<div class="outline-text-2" id="text-1">
<p>
Positive, conscientious, trustworthy, hardworking and reliable. An insatiable
thirst for technical knowledge. Able to pick up new skills and absorb new
concepts rapidly and effectively.
</p>
</div>
</div>

<div id="outline-container-orga17cebe" class="outline-2">
<h2 id="orga17cebe"><span class="section-number-2">2</span> Skills</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Advanced</b>: Ansible, Azure, Bash, Git, GitLab CI, Linux, Lisp, Make, Python, Terraform
</p>

<p>
<b>Intermediate</b>: Docker, Kubernetes, NodeJS, OpenBSD, Powershell, Atlassian Suite
</p>

<p>
<b>Beginner</b>: AWS, C, FreeBSD, GCP, Go, Nix, PHP, Rancher, SQL, ZFS, Jenkins
</p>
</div>
</div>

<div id="outline-container-orgc8c8b37" class="outline-2">
<h2 id="orgc8c8b37"><span class="section-number-2">3</span> Product Reliability Engineer, StorageOS, <i>07/2021 - current</i></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Tested and supported a cloud native, software defined storage engine that
facilitates stateful production workloads for Kubernetes environments.</li>

<li>Gained experience with Kubernetes, Rancher, Open Shift, GCP and AWS in
my time with StorageOS.</li>

<li>Role changed significantly in my first month from what I applied for. From an
engineering role to support and sales. Hence the desire to move on so
quickly.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb1cf62" class="outline-2">
<h2 id="orgbb1cf62"><span class="section-number-2">4</span> Platform Engineer, Open Energi, <i>06/2019 - 07/2021</i></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Created, maintained and automated infrastructure and API deployment driven
from GitLab CI/CD pipelines.</li>

<li>Knitted together Bash, Python, Ansible &amp; Terraform scripts, Makefiles and
Docker containers to create seamless, end to end, infrastructure as code,
testing and production environments.</li>

<li>Wrote unit and integration tests and fixed bugs in backend software written
in Python, NodeJS and Go.</li>

<li>Facilitated a team of Data Scientists to write clean and well tested code.</li>
</ul>
</div>
</div>

<div id="outline-container-org9b15c74" class="outline-2">
<h2 id="org9b15c74"><span class="section-number-2">5</span> Cloud Automation Engineer, Hentsu, <i>04/2019 - 06/2019</i></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Designed and implemented a MSP product that packaged, abstracted and extended
services provided by Azure &amp; AWS.</li>

<li>Automated Intune provisioning and Office 365 reporting in Azure with
Powershell.</li>

<li>Wrote Powershell modules for AzureAD, PartnerCenter, Graph and Intune.</li>
</ul>
</div>
</div>

<div id="outline-container-orgff67622" class="outline-2">
<h2 id="orgff67622"><span class="section-number-2">6</span> Automation Engineer, M&amp;C Saatchi, <i>12/2017 - 04/2019</i></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Automated the on-boarding of new starters to the company with Powershell,
which involved writing a number of modules to interact with a variety of 3rd
party APIs.</li>
<li>Wrote many Powershell, Bash and Python scripts to assist in deployment,
teardown, backup and monitoring of On-Prem and cloud based infrastructure and
user's machines. Most of these are available on my <a href="https://github.com/tslight">GitHub</a> or <a href="https://gitlab.com/tspub">GitLab</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9e2d37f" class="outline-2">
<h2 id="org9e2d37f"><span class="section-number-2">7</span> IT Consultant, Self-Employed, <i>03/2017 - 02/2018</i></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>System administration of Windows/macOS/Linux/OpenBSD/FreeBSD.</li>
<li>Network administration of Cisco, MikroTik &amp; Ubiquiti devices.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9f2e17" class="outline-2">
<h2 id="orgf9f2e17"><span class="section-number-2">8</span> Web Developer/Admin, Self-Employed, <i>05/2014 - 02/2018</i></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Web development using HTML, CSS, PHP &amp; JavaScript.</li>
<li>Domain name registration, web hosting, Wordpress &amp; email setup.</li>
</ul>
</div>
</div>

<div id="outline-container-org3349585" class="outline-2">
<h2 id="org3349585"><span class="section-number-2">9</span> Qualifications</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><b>BSc Computing</b>, Birkbeck University of London: <i>2015-2018</i></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Slight</p>
<p class="date">Created: 2021-08-18 Wed 22:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
