tslight.cv.tex
% Created 2021-08-18 Wed 22:03
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper]{article}
\usepackage[rm]{roboto}
\usepackage[defaultsans]{lato}
\usepackage{paracol}
\usepackage{cv}
\hypersetup{colorlinks=true, urlcolor={blue}}
\usepackage{enumitem}
\setlist{leftmargin=0.25in,nosep}
\author{Toby Slight}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Toby Slight},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)},
 pdflang={English}}
\begin{document}

\resheader{ Toby Slight }{ https://tslight.github.io }{ tslight@pm.me }{ +44 07412982139 }{ https://gitlab.com/tspub }{ https://github.com/tslight }

\section{Profile}
\label{sec:org79e6958}

Positive, conscientious, trustworthy, hardworking and reliable. An insatiable
thirst for technical knowledge. Able to pick up new skills and absorb new
concepts rapidly and effectively.

\section{Skills}
\label{sec:orge1212d5}

\textbf{Advanced}: Ansible, Azure, Bash, Git, GitLab CI, Linux, Lisp, Make, Python, Terraform

\textbf{Intermediate}: Docker, Kubernetes, NodeJS, OpenBSD, Powershell, Atlassian Suite

\textbf{Beginner}: AWS, C, FreeBSD, GCP, Go, Nix, PHP, Rancher, SQL, ZFS, Jenkins

\section{Product Reliability Engineer, StorageOS, \emph{07/2021 - current}}
\label{sec:orga48ee38}

\begin{itemize}
\item Tested and supported a cloud native, software defined storage engine that
facilitates stateful production workloads for Kubernetes environments.

\item Gained experience with Kubernetes, Rancher, Open Shift, GCP and AWS in
my time with StorageOS.

\item Role changed significantly in my first month from what I applied for. From an
engineering role to support and sales. Hence the desire to move on so
quickly.
\end{itemize}

\section{Platform Engineer, Open Energi, \emph{06/2019 - 07/2021}}
\label{sec:org56a4939}

\begin{itemize}
\item Created, maintained and automated infrastructure and API deployment driven
from GitLab CI/CD pipelines.

\item Knitted together Bash, Python, Ansible \& Terraform scripts, Makefiles and
Docker containers to create seamless, end to end, infrastructure as code,
testing and production environments.

\item Wrote unit and integration tests and fixed bugs in backend software written
in Python, NodeJS and Go.

\item Facilitated a team of Data Scientists to write clean and well tested code.
\end{itemize}

\section{Cloud Automation Engineer, Hentsu, \emph{04/2019 - 06/2019}}
\label{sec:org2edc323}

\begin{itemize}
\item Designed and implemented a MSP product that packaged, abstracted and extended
services provided by Azure \& AWS.

\item Automated Intune provisioning and Office 365 reporting in Azure with
Powershell.

\item Wrote Powershell modules for AzureAD, PartnerCenter, Graph and Intune.
\end{itemize}

\section{Automation Engineer, M\&C Saatchi, \emph{12/2017 - 04/2019}}
\label{sec:org6510056}

\begin{itemize}
\item Automated the on-boarding of new starters to the company with Powershell,
which involved writing a number of modules to interact with a variety of 3rd
party APIs.
\item Wrote many Powershell, Bash and Python scripts to assist in deployment,
teardown, backup and monitoring of On-Prem and cloud based infrastructure and
user's machines. Most of these are available on my \href{https://github.com/tslight}{GitHub} or \href{https://gitlab.com/tspub}{GitLab}.
\end{itemize}

\section{IT Consultant, Self-Employed, \emph{03/2017 - 02/2018}}
\label{sec:org88df412}

\begin{itemize}
\item System administration of Windows/macOS/Linux/OpenBSD/FreeBSD.
\item Network administration of Cisco, MikroTik \& Ubiquiti devices.
\end{itemize}

\section{Web Developer/Admin, Self-Employed, \emph{05/2014 - 02/2018}}
\label{sec:org4df61d9}

\begin{itemize}
\item Web development using HTML, CSS, PHP \& JavaScript.
\item Domain name registration, web hosting, Wordpress \& email setup.
\end{itemize}

\section{Qualifications}
\label{sec:org78d8803}

\begin{itemize}
\item \textbf{BSc Computing}, Birkbeck University of London: \emph{2015-2018}
\end{itemize}
\end{document}
